In [1]:
#pip install mysql-connector-python

In [2]:
import pandas as pd
from sqlalchemy import create_engine
hostname='localhost'
username='root'
password='admin'
dbname='Muse_Job_details'

In [30]:
df=pd.read_csv('data_analytics_clean.csv')
df.head()

,id,name,contents,levels,company,date_published,time_published
0,11414403,Member Specialist PT,Position Summary...What you'll do...Ensures ar...,mid,Walmart,2023-05-22,23:41:54
1,11380066,PwC Private - Japanese Business Network - Audi...,A career within PwC Private will provide the o...,senior,PwC,2023-05-16,11:25:21
2,11375065,"Calhoun, GA Delivery Driver",ARE YOU A CURRENT US FOODS EMPLOYEE? PLEASE AP...,mid,US Foods,2023-05-17,14:55:46
3,11291995,Senior Data Management Analyst,About this role: Wells Fargo is seeking a ...,senior,Wells Fargo,2023-05-26,23:46:34
4,11409323,"Data Engineer, Product Analytics - Monetization",From making valuable connections between peopl...,mid,Meta,2023-05-27,23:23:11

In [4]:
import mysql.connector as msql
from mysql.connector import Error

try:
    conn=msql.connect(host='localhost',user='root',password='admin')
    if conn.is_connected():
        cursor=conn.cursor()
        cursor.execute("CREATE DATABASE Muse_Job_details")
        print('Database is created')
except Error as e:
    print('Error while connecting to MySQL',e)

Error while connecting to MySQL 1007 (HY000): Can't create database 'muse_job_details'; database exists

In [5]:
df.head()

,id,name,contents,levels,company,date_published,time_published
0,11414403,Member Specialist PT,Position Summary...What you'll do...Ensures ar...,mid,Walmart,2023-05-22,23:41:54
1,11380066,PwC Private - Japanese Business Network - Audi...,A career within PwC Private will provide the o...,senior,PwC,2023-05-16,11:25:21
2,11375065,"Calhoun, GA Delivery Driver",ARE YOU A CURRENT US FOODS EMPLOYEE? PLEASE AP...,mid,US Foods,2023-05-17,14:55:46
3,11291995,Senior Data Management Analyst,About this role: Wells Fargo is seeking a ...,senior,Wells Fargo,2023-05-26,23:46:34
4,11409323,"Data Engineer, Product Analytics - Monetization",From making valuable connections between peopl...,mid,Meta,2023-05-27,23:23:11

In [6]:
df.columns

Index(['id', 'name', 'contents', 'levels', 'company', 'date_published',
       'time_published'],
      dtype='object')

In [32]:
table = (
"CREATE TABLE IF NOT EXISTS `Job_listings_DA` ("
"  `id` INT NOT NULL,"
"  `position title` VARCHAR(300) NULL,"
"  `description` TEXT(30000) NULL,"
"  `level` VARCHAR(20) NULL,"
"  `company` VARCHAR(90) NULL,"
"  `publish date` DATE NULL,"
"  `publish time` TIME NULL,"
"  PRIMARY KEY (`id`))"
"ENGINE = InnoDB  ")
try:
    conn = msql.connect( database=dbname,host=hostname,user=username,password=password)
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)
        cursor.execute('DROP TABLE IF EXISTS Job_listings_DA;')
        print('Creating table....')
        cursor.execute(table)
        print("Table is created....")
        #loop through the data frame
        for i,row in df.iterrows():
            #here %S means string values 
            sql = "INSERT INTO Muse_Job_details.Job_listings_DA VALUES (%s,%s,%s,%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            #print(f"{i+1} Records inserted")
            # the connection is not auto committed by default, so we must commit to save our changes
            conn.commit()
        print("All records inserted")
except Error as e:
            print("Error while connecting to MySQL", e)

You're connected to database:  ('muse_job_details',)
Creating table....
Table is created....
All records inserted

In [27]:
df=pd.read_csv('city_states.csv',names=['location_id','job_id','city','state'],skiprows=1)
df.head()

   location_id    job_id         city   state
0            0  11414403  Albuquerque      NM
1            1  11380066       Remote  Remote
2            2  11375065      Calhoun      GA
3            3  11291995    Charlotte      NC
4            4  11409323     Bellevue      WA

In [28]:
table = (
"CREATE TABLE IF NOT EXISTS `Locations` ("
"  `location_id` INT NOT NULL,"
"  `job_id` INT NOT NULL,"
"  `city` VARCHAR(30) NULL,"
"  `state` VARCHAR(30) NULL,"
"  PRIMARY KEY (`location_id`))"
"ENGINE = InnoDB  ")

In [29]:
try:
    conn = msql.connect( database=dbname,host=hostname,user=username,password=password)
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)
        cursor.execute('DROP TABLE IF EXISTS Locations;')
        print('Creating table....')
        cursor.execute(table)
        print("Table is created....")
        #loop through the data frame
        for i,row in df.iterrows():
            #here %S means string values 
            sql = "INSERT INTO Muse_Job_details.Locations VALUES (%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            #print(f"{i+1} Records inserted")
            # the connection is not auto committed by default, so we must commit to save our changes
            conn.commit()
        print("All records inserted")
except Error as e:
            print("Error while connecting to MySQL", e)

You're connected to database:  ('muse_job_details',)
Creating table....
Table is created....
All records inserted